
// console.log("Hello world") //консоль

// let string = "alloha"// строковый тип данных
// let не явное объявление перемонной
// string - имя переменной
// = это присвоение значение перем.
// "alloha" - значение переменной
// alert(string)  // окно на сайте , консоль текста 

// let integer = 10 //целое число
// console.log(integer) //консоль


// let float = 10.1 // число с точкой
// let boolean = true //= False 
// #################################################################################

//  let num = prompt("Введите число для возведение в квадрат")
//  // во внутрь переменной num мы передаем фунуции prompt()
//  //из клава в браузер
//  // потом в квадрат
//  num = num ** 2
//  // + (num = num + 1) значение увеличив на 1
//  //(num = num - 1)
//  //(num = num * 1)
//  //(num = num / 1)
//  //%  взятие остатка от деление (num = num % 3) остаток от деление 3

// //мы изменили переменную num и возвели ее значение в квадрат(во вторую степень)
// num = 8 - 1
//  alert(num)// выводит значение переменной num на экран
// //##################################################################################

// let num_First = Number(prompt())  
// let num_second = Number(prompt())

// let mid = (num_First + num_second) / 2
// alert(mid)


//#########################################################################################


let mid = Number(prompt("воз в квадрат"))

mid = mid ** 2
// mid** = 2

alert(mid)





